cshtb/stm32_practice/User/main.c
	data_to_send[_cnt++]=BYTE1(Gyro[0]);
	data_to_send[_cnt++]=BYTE0(Gyro[0]);
	data_to_send[_cnt++]=BYTE1(Gyro[1]);
	data_to_send[_cnt++]=BYTE0(Gyro[1]);
	data_to_send[_cnt++]=BYTE1(Gyro[2]);
	data_to_send[_cnt++]=BYTE0(Gyro[2]);
	data_to_send[_cnt++]=0;
	data_to_send[_cnt++]=0;
	data_to_send[_cnt++]=0;
	data_to_send[_cnt++]=0;
	data_to_send[_cnt++]=0;
	data_to_send[_cnt++]=0;
	
	data_to_send[3] = _cnt-4;
	//和校验
	for(i=0;i<_cnt;i++)
		sum+= data_to_send[i];
	data_to_send[_cnt++]=sum;
	
	//串口发送数据
	for(i=0;i<_cnt;i++)
		usart_send_char(data_to_send[i]);
}

extern struct inv_sensor_cal_t sensors;
/* Private define ------------------------------------------------------------*/

/* Private macro -------------------------------------------------------------*/
/* Private variables ---------------------------------------------------------*/
/* Private function prototypes -----------------------------------------------*/
/* ---------------------------------------------------------------------------*/
/* Get data from MPL.
 * TODO: Add return values to the inv_get_sensor_type_xxx APIs to differentiate
 * between new and stale data.
 */
static void read_from_mpl(void)//从陀螺仪中读取数据
{
    long msg, data[9];
    int8_t accuracy;
    unsigned long timestamp;
    float float_data[3] = {0};

    if (inv_get_sensor_type_quat(data, &accuracy, (inv_time_t*)&timestamp)) {
       /* Sends a quaternion packet to the PC. Since this is used by the Python
        * test app to visually represent a 3D quaternion, it's sent each time
        * the MPL has new data.
        */
        eMPL_send_quat(data);

        /* Specific data packets can be sent or suppressed using USB commands. */
        if (hal.report & PRINT_QUAT)
            eMPL_send_data(PACKET_DATA_QUAT, data);
    }

    if (hal.report & PRINT_ACCEL) {
        if (inv_get_sensor_type_accel(data, &accuracy,
            (inv_time_t*)&timestamp))
            eMPL_send_data(PACKET_DATA_ACCEL, data);
    }
    if (hal.report & PRINT_GYRO) {
        if (inv_get_sensor_type_gyro(data, &accuracy,
            (inv_time_t*)&timestamp))
            eMPL_send_data(PACKET_DATA_GYRO, data);
    }
#ifdef COMPASS_ENABLED
    if (hal.report & PRINT_COMPASS) {
        if (inv_get_sensor_type_compass(data, &accuracy,
            (inv_time_t*)&timestamp))
            eMPL_send_data(PACKET_DATA_COMPASS, data);
    }
#endif
    if (hal.report & PRINT_EULER) {
        if (inv_get_sensor_type_euler(data, &accuracy,
            (inv_time_t*)&timestamp))
            eMPL_send_data(PACKET_DATA_EULER, data);
    }
		
		
		/********************使用液晶屏显示数据**************************/
    if(1)
    {
				char cStr [ 70 ];
				unsigned long timestamp,step_count,walk_time;

			
				/*获取欧拉角*/

			  if (inv_get_sensor_type_euler(data, &accuracy,(inv_time_t*)&timestamp))
						{
																		
						#ifdef USE_LCD_DISPLAY
									sprintf ( cStr, "Pitch :  %.4f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(7),(uint8_t* )cStr);			

									
									sprintf ( cStr, "Roll  :  %.4f  ", data[1]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(8),(uint8_t* )cStr);	
									
									sprintf ( cStr, "Yaw   :  %.4f  ", data[2]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(9),(uint8_t* )cStr);	
									
									/*温度*/
									mpu_get_temperature(data,(inv_time_t*)&timestamp); 
									
									sprintf ( cStr, "Temperature  :  %.2f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									LCD_DisplayStringLine(LINE(10),(uint8_t* )cStr);	
						#endif
						
						}
						
					/*获取步数*/        
				get_tick_count(&timestamp);
				if (timestamp > hal.next_pedo_ms) {

						hal.next_pedo_ms = timestamp + PEDO_READ_MS;
						dmp_get_pedometer_step_count(&step_count);
						dmp_get_pedometer_walk_time(&walk_time);				

						#ifdef USE_LCD_DISPLAY
									sprintf(cStr, "Walked steps :  %ld  steps over  %ld  milliseconds..",step_count,walk_time);
									LCD_DisplayStringLine(LINE(11),(uint8_t* )cStr);	 
						#endif				
				}
			}
		
		/****************************使用串口助手显示****************************/
    if(1)
    {
				char cStr_1 [70];
				char cStr_2 [70];
				char cStr_3 [70];
				unsigned long timestamp_1,step_count_1,walk_time_1;

			
				/*获取欧拉角*/
			  if (inv_get_sensor_type_euler(data, &accuracy,(inv_time_t*)&timestamp_1))
						{
																		
						#ifdef USE_USART_DISPLAY
									sprintf ( cStr_1, "Pitch :  %.4f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(7),(uint8_t* )cStr_1);			
									printf("%s \n", (uint8_t* )cStr_1); //输出俯仰角
									
									sprintf ( cStr_1, "Roll  :  %.4f  ", data[1]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(8),(uint8_t* )cStr_1);	
									printf("%s \n", (uint8_t* )cStr_1); //输出翻滚角
									
									sprintf ( cStr_1, "Yaw   :  %.4f  ", data[2]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(9),(uint8_t* )cStr_1);	
									printf("%s \n", (uint8_t* )cStr_1); //输出偏航角
									
									/*温度*/
									mpu_get_temperature(data,(inv_time_t*)&timestamp_1); 
									
									sprintf ( cStr_1, "Temperature  :  %.2f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_euler读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(10),(uint8_t* )cStr_1);
									printf("%s \n", (uint8_t* )cStr_1); 
						#endif
						
						}
						
						/*获取加速度*/
						if (inv_get_sensor_type_accel(data, &accuracy,(inv_time_t*)&timestamp))
						{																									
						#ifdef USE_USART_DISPLAY
									sprintf ( cStr_2, "accel_x :  %.4f  ", data[0]*1.0/(1<<16) );	//inv_get_sensor_type_accel读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(7),(uint8_t* )cStr_1);			
									printf("%s \n", (uint8_t* )cStr_2); //输出
									
									sprintf ( cStr_2, "accel_y  :  %.4f  ", data[1]*1.0/(1<<16) );	//inv_get_sensor_type_accel读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(8),(uint8_t* )cStr_1);	
									printf("%s \n", (uint8_t* )cStr_2); //输出
									
									sprintf ( cStr_2, "accel_z   :  %.4f  ", data[2]*1.0/(1<<16) );	//inv_get_sensor_type_accel读出的数据是Q16格式，所以左移16位.
									//LCD_DisplayStringLine(LINE(9),(uint8_t* )cStr_1);	
									printf("%s \n", (uint8_t* )cStr_2); //输出

						#endif
							
